<a href="https://colab.research.google.com/github/arturgmrs/imd_tec_002/blob/master/aula_3_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


# Pacote Pandas-Python

Adaptado: 
Disciplina: Análise da Aprendizagem (ITE 0021) 

---
Prof.s Isabel Nunes e Luiz Affonso Guedes

PPGTI - UFRN
2019-2

## Pacote Pandas - Parte I

Pandas é construído sobre o Pacote Numpy. Porém, direntemente dos arrays de NumPy, variáveis manipuladas pelo Pandas podem ser de tipos diversos (não homogêneos). Assim, uma determinada variável pode contém elementos de diversos tipos. DataFrame e Series são exemplos de dados complexo de Pandas. 

DataFrames são dados "retangulares", usualmente utilizados para representar informação em formato de planilha, por exemplo. Assim, as colunas devem ter as mesmas dimensões e cada coluna contém elementos de um mesmo tipo de dado.

Series são objetos tipo array uni-dimensional contendo um array de dados (equivalente ao array uni-dimensional NumPy) e um array de labels do array de dados (denominados de index da Serie). Na sua forma mais simples, Series podem conter apenas os arrays de dados. Neste caso, os indexes segue o padrão dos arrays NumPy (índices de zero a n-1).

Pandas implementa uma série de operações sobre dados para usuários familiarizados com banco de dados e planilhas.




Convensão de notação:
- from pandas import Series, DataFrame
- import pandas as pd

In [ ]:
# Exemplo: Importanto Pandas

from pandas import Series, DataFrame
import pandas as pd

Series Pandas podem ser vistas como o equivalente ao tipo básico dictionaries. Porém, assim como operações em arrays NumPy são mais eficientes que em Listas, operar em Series é bem mais eficiente que operarar sobre variáveis do tipo Dictonarie.

In [ ]:
# Exemplo: População de alguns estados dos Estados Unidos - Definido como dicionário

pop_dict = {'California': 38332521,
'Texas': 26448193,
'New York': 19651127,
'Florida': 19552860,
'Illinois': 12882135}

In [ ]:
# Exemplo: Área de alguns estados dos Estados Unidos
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
'Florida': 170312, 'Illinois': 149995}

In [ ]:
dict.values(pop_dict)

dict_values([38332521, 26448193, 19651127, 19552860, 12882135])

In [ ]:
dict.keys(pop_dict)

dict_keys(['California', 'Texas', 'New York', 'Florida', 'Illinois'])

In [ ]:
#Exercícios: 
#           - Transforme a variável dicionario 'area_dict' em uma Serie-Pandas
#           - Transforme a variável dicionario 'pop_dict' em uma Serie-Pandas        
#           - Obtenha os estados com mais de 20 milhões de habitantes.
#           - Obtenha o número de habitantes da California
#           - Obtenha o estado com mais habitantes
#           - Obtenha o estado com menos habitantes
#           - Obtenha a lista dos estados com área entre 400.000 e 500.000 
#           - A densidade (número de habitantes por área) desses estados

In [ ]:
# Transformar dicionário area_dict em Serie-Pandas

area_serie = Series(area_dict)

In [ ]:
# Obtendo os valores de uma Serie
area_serie.values

array([423967, 695662, 141297, 170312, 149995])

In [ ]:
# Obtendo os indexs das séries
area_serie.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [ ]:
# Transformar dicionário pop_dict em Serie-Pandas

pop_serie = Series(pop_dict)

In [ ]:
# Obtendo a situação das áreas dos estados
area_serie>400000

California     True
Texas          True
New York      False
Florida       False
Illinois      False
dtype: bool

In [ ]:
# Obtendo apenas os estados com áreas acima de 400000
area_serie[area_serie>400000]

California    423967
Texas         695662
dtype: int64

In [ ]:
# Obtenha os estados com mais de 20 milhões de habitantes.

In [ ]:
# Obtenha o número de habitantes da California

In [ ]:
# Obtenha o estado com mais habitantes

In [ ]:
# Obtenha o estado com menos habitantes

In [ ]:
# Obtenha a lista dos estados com área entre 400.000 e 500.000

In [ ]:
# A densidade (número de habitantes por área) desses estados

Os Indexers: loc, iloc
- indicação de índice específico. --> dado[3]
- indicação de intervalo de índices. --> dado[1:3]. Segue o padrão de Lista.
- métodos .loc(), .iloc()

In [ ]:
# Exemplo de indicação de índice em Pandas

data = pd.Series(['a', 'b', 'c', 'd'], index=[1,3, 5, 7])
#data = pd.Series(['a', 'b', 'c', 'd'])
data

1    a
3    b
5    c
7    d
dtype: object

In [ ]:
# Exemplo de indicação específica de índice em Pandas
data[1]
#data[0]

'a'

In [ ]:
# Exemplo de indicação de intervalo de índice em Pandas
data[1:3]
#data[0:2]

3    b
5    c
dtype: object

In [ ]:
# Exemplo de indicação de índice em Pandas usando o método .loc()
print(data.loc[1])
print()
print(data.loc[1:3])

a

1    a
3    b
dtype: object

In [ ]:
# Exemplo de indicação de índice em Pandas usando o método .iloc()
print(data.iloc[1])
print()
print(data.iloc[1:3])

b

3    b
5    c
dtype: object

### Objeto do tipo DataFrame em Pandas

Se uma Serie-Pandas é um análogo de um array NumPy unidimensional com índices explícitos e flexíveis, então um DataFrame é um análogo de array NumPy bidimensional com índices de linha e de colunas flexíveis.

Assim, DataFrame Pandas equivale a uma Matriz com índices explícitos, porém, diferentemenete dos arrays NumPy, os elementos podem ser de tipos diferentes.

DataFrames podem ser vistos como uma sequência de objetos Series-Pandas alinhados por índices.

In [ ]:
# Exemplo - Transformação de dict em Serie-Pandas
populacao = pd.Series(pop_dict)
populacao

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [ ]:
# Exemplo - Transformação de dict em Serie-Pandas
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [ ]:
# Exemplo - Criação de um DataFrame Pandas

estados = pd.DataFrame({'população': populacao,'área': area})
estados

            população    área
California   38332521  423967
Texas        26448193  695662
New York     19651127  141297
Florida      19552860  170312
Illinois     12882135  149995

In [ ]:
type(estados)

pandas.core.frame.DataFrame

In [ ]:
estados.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [ ]:
estados.columns

Index(['população', 'área'], dtype='object')

Da mesma forma, também podemos pensar em um DataFrame como uma especialização de um dicionário. Onde um dicionário mapeia uma chave para um valor, um DataFrame mapeia um nome de coluna para uma série de dados de coluna. Por exemplo, pedir o atributo 'área' retorna o objeto Series que contém as áreas que vimos anteriormente:

In [ ]:
estados['área']

In [ ]:
# Cálculo da densidade populacional

DataFrame Pandas podem ser criados de diversas formas.
- A partir de objetos Series
- A partir de Listas de Dicionários
- A partir de Dicionários de objetos Series
- A partir de arrays NumPy bidimensionais
- A partir de array NumPy estruturado

In [ ]:
# Exemplo: Criação de DataFrame Pandas a partir de objetos Series
pd.DataFrame(populacao, columns=['população'])

            população
California   38332521
Texas        26448193
New York     19651127
Florida      19552860
Illinois     12882135

In [ ]:
# Exemplo: Criação de DataFrame Pandas a partir de Lista de Dicionário
# Data Missing (Dados perdidos) 

pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

#### Tratando Data Missing em DataFrame
De forma similar a Series, podemos tratar data missing em DataFrame
- técnicas de eliminação
    - df.dropna(parametros)
- técnicas de preenchimento
    - df.fillna(parametros)

In [ ]:
# Exemplo: Eliminando data missing em DataFrames
# Eliminar as linhas com NaN
# Eliminar as colunas com NaN
# Eliminar as linhas e colunas com NaN

dataF = DataFrame([[1., 6.5, 3.], [1., None, None], [None, None, None], [None, 6.5, 3.]])
dataF

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
dataF.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
dataF.dropna()

     0    1    2
0  1.0  6.5  3.0

In [ ]:
dataF.dropna(axis='columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
dataF.dropna(how='all', axis='columns')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
# Exemplo: Preenchimento de data missing em DataFrames
import numpy as np

df = DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -1.611650 -2.103082  0.928653
1 -0.339425 -1.882230  0.772786
2  0.872080  1.181768  0.489367
3  1.302030  0.536563  1.179666
4  0.179321 -0.058460  0.775693
5  0.260713 -0.729429  0.221849
6  0.667699 -1.536815 -0.270791

In [ ]:
df.iloc[:4, 1] = None; df.iloc[:2, 2] = None
df

          0         1         2
0 -1.611650       NaN       NaN
1 -0.339425       NaN       NaN
2  0.872080       NaN  0.489367
3  1.302030       NaN  1.179666
4  0.179321 -0.058460  0.775693
5  0.260713 -0.729429  0.221849
6  0.667699 -1.536815 -0.270791

In [ ]:
# Exemplo: Preenchimento de data missing em DataFrames
#          com valor ZERO

df.fillna(0)

          0         1         2
0  2.226750  0.000000  0.000000
1 -0.200829  0.000000  0.000000
2 -1.377001  0.000000  0.291058
3  0.347952  0.000000  0.923190
4 -0.510183 -0.328755 -1.280334
5  0.492568 -0.325251 -1.040472
6  1.462868 -0.098653 -0.218129

In [ ]:
df.iloc[3:4,0:1] = None
df

          0         1         2
0  2.226750       NaN       NaN
1 -0.200829       NaN       NaN
2 -1.377001       NaN  0.291058
3       NaN       NaN  0.923190
4 -0.510183 -0.328755 -1.280334
5  0.492568 -0.325251 -1.040472
6  1.462868 -0.098653 -0.218129

In [ ]:
# Exemplo: Preenchimento de data missing em DataFrames
df.fillna(method='ffill')

          0         1         2
0 -1.611650       NaN       NaN
1 -0.339425       NaN       NaN
2  0.872080       NaN  0.489367
3  1.302030       NaN  1.179666
4  0.179321 -0.058460  0.775693
5  0.260713 -0.729429  0.221849
6  0.667699 -1.536815 -0.270791

In [ ]:
# Exemplo: Preenchimento de data missing em DataFrames
# Chamando .fillna() com um tipo 'dict', 
# pode-se usar um valor diferente de preenchimento para cada coluna

df.fillna({1: 0.5, 2: -1})

          0         1         2
0 -1.611650  0.500000 -1.000000
1 -0.339425  0.500000 -1.000000
2  0.872080  0.500000  0.489367
3  1.302030  0.500000  1.179666
4  0.179321 -0.058460  0.775693
5  0.260713 -0.729429  0.221849
6  0.667699 -1.536815 -0.270791

In [ ]:
# Exemplo: Criação de DataFrame Pandas 
#          a partir Dicionários de objetos Series

pd.DataFrame({'população1': populacao,'área1': area})

            população1   área1
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

A seguir, são apresentados alguns exemplos de como acessar DataFrames e elementos de DataFrames

In [ ]:
estados

            população    área
California   38332521  423967
Texas        26448193  695662
New York     19651127  141297
Florida      19552860  170312
Illinois     12882135  149995

In [ ]:
estados['área']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: área, dtype: int64

In [ ]:
estados[['área']]

              área
California  423967
Texas       695662
New York    141297
Florida     170312
Illinois    149995

In [ ]:
estados[['área','população']]

              área  população
California  423967   38332521
Texas       695662   26448193
New York    141297   19651127
Florida     170312   19552860
Illinois    149995   12882135

In [ ]:
estados[['população','área', 'área']]

            população    área    área
California   38332521  423967  423967
Texas        26448193  695662  695662
New York     19651127  141297  141297
Florida      19552860  170312  170312
Illinois     12882135  149995  149995

In [ ]:
estados[['população','área', 'área']][0:3].área

              área    área
California  423967  423967
Texas       695662  695662
New York    141297  141297

In [ ]:
estados.área

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: área, dtype: int64

Incluir e modificar colunas no DataFrame Pandas
- uma das formas, pode ser usando uma sintaxe similar à sintaxe de dicionários com objetos Series Pandas.

In [ ]:
# Exemplo - Inclusão de uma nova coluna no DataFrame Pandas

estados['densidade'] = estados['população'] / estados['área']
estados

            população    área   densidade
California   38332521  423967   90.413926
Texas        26448193  695662   38.018740
New York     19651127  141297  139.076746
Florida      19552860  170312  114.806121
Illinois     12882135  149995   85.883763

Como DataFrames podem ser arrays bidimensionais, podemos utilizar operações a esses.

In [ ]:
# Exemplo - Como inverter a representação do DataFrame Pandas
estados.T

             California         Texas      New York       Florida      Illinois
população  3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
área       4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
densidade  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [ ]:
# Exemplo - Obtendo índicers de DataFrames Pandas
estados.values

array([[3.83325210e+07, 4.23967000e+05, 9.04139261e+01],
       [2.64481930e+07, 6.95662000e+05, 3.80187404e+01],
       [1.96511270e+07, 1.41297000e+05, 1.39076746e+02],
       [1.95528600e+07, 1.70312000e+05, 1.14806121e+02],
       [1.28821350e+07, 1.49995000e+05, 8.58837628e+01]])

In [ ]:
# Exemplo - Obtendo índices de DataFrames Pandas
estados.values[0]

array([3.83325210e+07, 4.23967000e+05, 9.04139261e+01])

In [ ]:
# Exemplo - Obtendo índices de DataFrames Pandas
estados.values[:][0]

array([3.83325210e+07, 4.23967000e+05, 9.04139261e+01])

In [ ]:
estados[estados.densidade > 100]

          população    área   densidade
New York   19651127  141297  139.076746
Florida    19552860  170312  114.806121

In [ ]:
estados.densidade > 100

California    False
Texas         False
New York       True
Florida        True
Illinois      False
Name: densidade, dtype: bool

In [ ]:
estados[estados.densidade > 100].densidade

New York    139.076746
Florida     114.806121
Name: densidade, dtype: float64

In [ ]:
estados[estados.densidade > 100][['população', 'densidade']]

          população   densidade
New York   19651127  139.076746
Florida    19552860  114.806121

In [ ]:
# Exercício: Liste o atributo 'densidade'
#           dos estados da Florida e Illinois

In [ ]:
# Exemplo de listagem de sub-DataFrame em Pandas
# O método .iloc() pemite acesso por numeração - localicação

estados.iloc[:3, :2]

#estados[:3,:2]

In [ ]:
# Exemplo de listagem de sub-DataFrame em Pandas
# O método .loc() permite acesso por labels

estados.loc[:'Illinois', :'população']

            população
California   38332521
Texas        26448193
New York     19651127
Florida      19552860
Illinois     12882135

In [ ]:
estados

            população    área   densidade
California   38332521  423967   90.413926
Texas        26448193  695662   38.018740
New York     19651127  141297  139.076746
Florida      19552860  170312  114.806121
Illinois     12882135  149995   85.883763

In [ ]:
# Exemplo de listagem de sub-DataFrame em Pandas
# Uso do estilo NumPy para acessar sub Arrays
# Formato:
# dataFrame.loc[LINHAS, COLUNAS]

estados.loc[estados.densidade > 100, ['população', 'densidade']]

          população   densidade
New York   19651127  139.076746
Florida    19552860  114.806121

In [ ]:
# Exercício: 
# Obenha apenas os Estados com população acima de 20 milhões.
# Exiba as colunas 'população'e 'densidade'

Métodos:
    - pd.head(x)  --> lista as x primeiras linhas do DataFrame
    - pd.tail(x)  --> lista as x últimas linhas do DataFrame
    - pd.info()   --> resume o conteúdo do DataFrame

In [ ]:
# Exemplo de uso do método pd.head()
estados.head(2)
#estados.head()

            população    área  densidade
California   38332521  423967  90.413926
Texas        26448193  695662  38.018740

In [ ]:
# Exemplo de uso do método pd.tail()
estados.tail(2)
#estados.tail()

          população    área   densidade
Florida    19552860  170312  114.806121
Illinois   12882135  149995   85.883763

In [ ]:
# Exemplo de uso do método pd.info()
estados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, California to Illinois
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   população  5 non-null      int64
 1   área       5 non-null      int64
 2   densidade  5 non-null      float64
dtypes: float64(1), int64(2)
memory usage: 320.0+ bytes

Como se pode alterar os valores de elementos de DataFrames?

### Pandas foi desenvolvido sobre o NumPy e manteve a compatibilidade das operações NumPy.
- dados Pandas (Series, DataFrame) aceitam as operações NumPy

In [ ]:
# Exemplo de operação NumPy sobre dados Pandas
# Definindo o objeto ser - Tipo Series Pandas
import pandas as pd
import numpy as np

rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [ ]:
# Exemplo de operação NumPy sobre dados Pandas
# Operação exponencial sobre um objeto Series Pandas

np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [ ]:
# Exemplo de operação NumPy sobre dados Pandas
# Definindo o objeto df - Tipo DataFrame Pandas

df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [ ]:
# Exemplo de operação NumPy sobre dados Pandas
# Operação seno sobre um objeto DataFrame Pandas

np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

## Carregar, armazenar e formatar DataFrames

### Métodos para carregar/ler/importar dados tipo DataFrame Pandas

Pandas possui vários métodos para ler dados tabulados.
- pd.read_csv('arquivo.csv', parametros). Carrega dado com formato .csv delimitado a partir de um arquivo, URL ou objeto tipo arquivo. Usa vígula como delimitador padrão.


- pd.read_table(árquivo.txt', parametros) -  Carrega dado delimitado a partir de arquivo, URL, ou objeto tipo arquivo. Usa tab ('\t') como delimitador padrão.

In [ ]:
import pandas as pd
teste1 = pd.read_csv('ScoobyDoo.csv')

In [ ]:
teste1

In [ ]:
teste2 = pd.read_csv('ScoobyDoo.csv', header=None)

In [ ]:
teste2

In [ ]:
# Exemplo: Obtendo informação do DataFrame
teste1.info()

In [ ]:
teste3 = pd.read_csv('ScoobyDoo.csv', names=['Coluna 1', 'Coluna 2'])
teste3

In [ ]:
teste3.describe()

Exemplos de algumas possibilidades de cálculo com DataFrame

In [ ]:
teste1['idade'].sum()

In [ ]:
teste1['idade']>19

In [ ]:
teste1['idade'].mean()

In [ ]:
# Exercício: Inclua uma coluna 'Sexo'no DataFrame teste1
# Atribua o sexo adequadamente para os personagens 
# ('M'- masculino, 'F' - Feminino')
# Calcule a média de idade dos personagens femininos

In [ ]:
# Exercício: Inclua uma coluna 'Peso' no DataFrame teste1
# Scooby - 40 kg
# Salsicha - 55 kg
# Fred  - 70 Kg
# 
# Velma = None
# Daphne = 50 Kg

In [ ]:
# Exercício: Inclua uma coluna 'Altura' no DataFrame teste1
# Scooby - 1.5m
# Salsicha - 1.75m
# Fred  - 1.80m
# 
# Velma = 1.60m
# Daphne = 1.65m

In [ ]:
# Exercício: Inclua uma coluna 'IMC' no DataFrame teste1
# Preencha essa coluna com o valor de Índice de Massa Corporea dos personagens
# Obtenha o personagem que tem a menor IMC

### Lendo arquivos via URL

In [ ]:
# arquivo do GitHub - Livro Handbook of data Science
Estados_USA = pd.read_csv('https://raw.githubusercontent.com/jakevdp/PythonDataScienceHandbook/master/notebooks/data/state-population.csv')

In [ ]:
Estados_USA

     state/region     ages  year   population
0              AL  under18  2012    1117489.0
1              AL    total  2012    4817528.0
2              AL  under18  2010    1130966.0
3              AL    total  2010    4785570.0
4              AL  under18  2011    1125763.0
...           ...      ...   ...          ...
2539          USA    total  2010  309326295.0
2540          USA  under18  2011   73902222.0
2541          USA    total  2011  311582564.0
2542          USA  under18  2012   73708179.0
2543          USA    total  2012  313873685.0

[2544 rows x 4 columns]